docs/overview.org
#+TITLE: Repeat Masking Pipeline
#+HTML_HEAD: <link href="./theme.css" rel="stylesheet">

* Installing

  Ideally, the only prerequisites would be [[https://www.nextflow.io/][Nextflow]] and
  [[https://www.docker.com/][Docker]]. Unfortunately, it's almost impossible to do work on repeats
  without the RepBase library which carries licence restrictions so
  I'm unable to include the library in the Docker image.

  To build your own image that /does/ include the RepBase libraries,
  run:

  #+BEGIN_SRC sh
    cd `mktemp -d`

    # Download the RepBase repeat library (replace RB_USERNAME and RB_PASSWORD with your username and password)
    wget --user $RB_USERNAME \
         --password $RB_PASSWORD \
         --output-document repeatmaskerlibraries.tar.gz \
         http://www.girinst.org/server/RepBase/protected/repeatmaskerlibraries/repeatmaskerlibraries-20140131.tar.gz

    # Make an (almost) empty Dockerfile.
    #  All of the important instructions are in the repeatmasker-onbuild image
    #  You can view them here: https://github.com/robsyme/nextflow-annotate/blob/master/Dockerfiles/RepeatMasker-onbuild/Dockerfile
    echo "FROM robsyme/nf-repeatmasking-onbuild" > Dockerfile

    # Build a new docker image called 'nf-repeatmasking'.
    #  When building, this image looks for a file called 'repeatmaskerlibraries.tar.gz' which it pulls into the image.
    docker build -t robsyme/nf-repeatmasking .
  #+END_SRC

* Walkthrough
** Introduction
   This is a [[https://en.wikipedia.org/wiki/Literate_programming][literate-programming]] style walk through the pipeline,
   explaining the utility of every section. Each code block below gets
   tangled to compose the  pipline, which is written out to [[file:../main.nf][=main.nf=]].
** Parameter Setup

   There is some necessary setup and housekeeping to begin. This is
   where we set up our strain name, the path to our reference sequence
   and the output location for our final figures and tables.

   #+BEGIN_SRC groovy :tangle ../main.nf :shebang #!/usr/bin/env nextflow
         VERSION = "1.0.0"

         params.reference = 'data/example/genome.fasta'
         params.trnaprot = 'http://www.hrt.msu.edu/uploads/535/78637/Tpases020812.gz'
         params.trnanuc = 'http://gtrnadb2009.ucsc.edu/download/tRNAs/eukaryotic-tRNAs.fa.gz'
         params.outdir = 'output'
         params.minRepLength = 250

         trnanuc = file(params.trnanuc)
         trnaprot = file(params.trnaprot)
         reference = file(params.reference)

         log.info ""
         log.info "R E P E A T M A S K I N G  ~  version " + VERSION
         log.info "reference input    : ${params.reference}"
         log.info "output directory   : ${params.outdir}"
         log.info ""
   #+END_SRC

