docs/overview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-03 Wed 16:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Repeat Masking Pipeline</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Robert Syme" />
<link href="./theme.css" rel="stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">Repeat Masking Pipeline</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2722ddc">1. Installing</a></li>
<li><a href="#orgb236b89">2. Walkthrough</a>
<ul>
<li><a href="#orgf3006e5">2.1. Introduction</a></li>
<li><a href="#org18191d0">2.2. Parameter Setup</a></li>
<li><a href="#orgafd5440">2.3. Collection of relatively recent LTR retrotranposons</a></li>
<li><a href="#org57db473">2.4. Collection of relatively old LTR retrotransposons</a></li>
<li><a href="#orgbe302cb">2.5. Cleaning LTR results</a></li>
<li><a href="#orgcae4ec4">2.6. Identify elements with nested insertions</a></li>
<li><a href="#orgeadaf53">2.7. Noncoding RNA</a></li>
<li><a href="#org41d7682">2.8. Final Masking</a></li>
<li><a href="#org478605c">2.9. Summary tables and figures</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2722ddc" class="outline-2">
<h2 id="org2722ddc"><span class="section-number-2">1</span> Installing</h2>
<div class="outline-text-2" id="text-1">
<p>
Ideally, the only prerequisites would be <a href="https://www.nextflow.io/">Nextflow</a> and
<a href="https://www.docker.com/">Docker</a>. Unfortunately, it's almost impossible to do work on repeats
without the RepBase library which carries licence restrictions so
I'm unable to include the library in the Docker image.
</p>

<p>
To build your own image that <i>does</i> include the RepBase libraries,
run:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #c678dd;">cd</span> <span style="color: #51afef; font-weight: bold;">`mktemp -d`</span>

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Download the RepBase repeat library (replace RB_USERNAME and RB_PASSWORD with your username and password)</span>
wget --user $<span style="color: #dcaeea;">RB_USERNAME</span> <span style="color: #98be65;">\</span>
     --password $<span style="color: #dcaeea;">RB_PASSWORD</span> <span style="color: #98be65;">\</span>
     --output-document repeatmaskerlibraries.tar.gz <span style="color: #98be65;">\</span>
     http://www.girinst.org/server/RepBase/protected/repeatmaskerlibraries/repeatmaskerlibraries-20140131.tar.gz

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Make an (almost) empty Dockerfile.</span>
<span style="color: #5B6268;">#  </span><span style="color: #5B6268;">All of the important instructions are in the repeatmasker-onbuild image</span>
<span style="color: #5B6268;">#  </span><span style="color: #5B6268;">You can view them here: https://github.com/robsyme/nextflow-annotate/blob/master/Dockerfiles/RepeatMasker-onbuild/Dockerfile</span>
<span style="color: #c678dd;">echo</span> <span style="color: #98be65;">"FROM robsyme/nf-repeatmasking"</span> &gt; Dockerfile

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Build a new docker image called 'nf-repeatmasking'.</span>
<span style="color: #5B6268;">#  </span><span style="color: #5B6268;">When building, this image looks for a file called 'repeatmaskerlibraries.tar.gz' which it pulls into the image.</span>
docker build -t repeats .
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb236b89" class="outline-2">
<h2 id="orgb236b89"><span class="section-number-2">2</span> Walkthrough</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf3006e5" class="outline-3">
<h3 id="orgf3006e5"><span class="section-number-3">2.1</span> Introduction</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This is a <a href="https://en.wikipedia.org/wiki/Literate_programming">literate-programming</a> style walk through the pipeline,
explaining the utility of every section. Each code block below gets
tangled to compose the  pipline, which is written out to <a href="../main.nf"><code>main.nf</code></a>.
</p>
</div>
</div>
<div id="outline-container-org18191d0" class="outline-3">
<h3 id="org18191d0"><span class="section-number-3">2.2</span> Parameter Setup</h3>
<div class="outline-text-3" id="text-2-2">
<p>
There is some necessary setup and housekeeping to begin. This is
where we set up our strain name, the path to our reference sequence
and the output location for our final figures and tables.
</p>

<div class="org-src-container">
<pre class="src src-groovy">VERSION = <span style="color: #98be65;">"1.0.0"</span>

params.reference = <span style="color: #98be65;">'data/example/genome.fasta'</span>
params.trnaprot = <span style="color: #98be65;">'http://www.hrt.msu.edu/uploads/535/78637/Tpases020812.gz'</span>
params.trnanuc = <span style="color: #98be65;">'http://gtrnadb2009.ucsc.edu/download/tRNAs/eukaryotic-tRNAs.fa.gz'</span>
params.outdir = <span style="color: #98be65;">'output'</span>
params.minRepLength = 250

trnanuc = file(params.trnanuc)
trnaprot = file(params.trnaprot)
reference = file(params.reference)

log.info <span style="color: #98be65;">""</span>
log.info <span style="color: #98be65;">"R E P E A T M A S K I N G  ~  version "</span> + VERSION
log.info <span style="color: #98be65;">"reference input    : </span><span style="color: #dcaeea;">${params.reference}</span><span style="color: #98be65;">"</span>
log.info <span style="color: #98be65;">"output directory   : </span><span style="color: #dcaeea;">${params.outdir}</span><span style="color: #98be65;">"</span>
log.info <span style="color: #98be65;">""</span>
</pre>
</div>
</div>
</div>
