docs/overview.org
** Collection of relatively recent LTR retrotranposons

    The rationale for initial collection of recent LTR elements is
    that these elements contain less nested insertions and mutations
    as well as recombination, thus the chance for false positives is
    relatively low. We use the ltrharvest command from [[http://genometools.org][genometools]] to
    collect potential LTR sequences with the following
    characteristics:

    - Two terminal repeats which are >= 99% similar, ranging from 100 bp tp 6000 bp
    - The two terminal repeats end with “TG…CA”
    - The size of entire element ranges from 1.5 kb to 25 kb
    - The element must be flanked by a 5bp TSD (target site duplication)
    - The TSD is within 10 bp from the end of the element

    The results are then passed through =ltrdigest= (again, from
    genometools) to retain only those elements with polypurine tract
    (PPT) and primer binding site (PBS).

    The =CRL_Step1= script ensures that at least 50% of the PPT or PBS
    sequences are located in the internal regions and the distance
    between LTR and PPT or PBS are no more than 20 bp.

    The =CRL_Step2= script filters again. False positives due to gene
    clusters may still linger in the output from =CRL_Step1=. These
    instances will have alignable regions that extend past the LTR
    boundary. We pull out the flanking sequence from the putative LTR,
    and if the flanking sequence /also/ aligns, we discard it.

    #+BEGIN_SRC groovy :tangle ../main.nf
      process recentLTRs {
        container 'robsyme/nf-repeatmasking'
        cache 'deep'

        input:
        file 'genome.fasta' from reference
        file 'eukaryotic-tRNAs.fasta.gz' from trnanuc

        output:
        set age, 'seqfile.result' into ltrHarvestResultsNew
        set age, 'seqfile.result' into ltrHarvestResultsForExemplarNew
        set age, 'seqfile.outinner' into ltrHarvestInnerNew
        set age, 'seqfile.outinner' into outinnerForBlastXNew
        set age, 'CRL_Step2_Passed_Elements.fasta', 'Repeat_down*.fasta', 'Repeat_up*.fasta' into recentLTRs

        script:
        age = 'new'
        """
      gt suffixerator -db genome.fasta -indexname genome.fasta -tis -suf -lcp -des -ssp -dna

      gt ltrharvest \
       -index genome.fasta \
       -out seqfile.out \
       -outinner seqfile.outinner \
       -gff3 seqfile.gff \
       -minlenltr 100 \
       -maxlenltr 6000 \
       -mindistltr 1500 \
       -maxdistltr 25000 \
       -mintsd 5 \
       -maxtsd 5 \
       -motif tgca \
       -similar 99 \
       -vic 10 \
      > seqfile.result

      gt gff3 \
       -sort seqfile.gff \
      > seqfile.gff.sort

      zcat eukaryotic-tRNAs.fasta.gz > eukaryotic-tRNAs.fasta

      gt ltrdigest \
       -trnas eukaryotic-tRNAs.fasta \
       seqfile.gff.sort \
       genome.fasta \
      > seqfile.gff.dgt

      CRL_Step1.pl \
       --gff seqfile.gff.dgt

      CRL_Step2.pl \
       --step1 CRL_Step1_Passed_Elements.txt \
       --repeatfile seqfile.out \
       --resultfile seqfile.result \
       --sequencefile genome.fasta \
       --removed_repeats CRL_Step2_Passed_Elements.fasta
        """
      }
    #+END_SRC

** Collection of relatively old LTR retrotransposons

    Collection of relatively old LTRs is enabled by reducing the
    similarity between LTRs to 85% (default value of LTRharvest) and
    not associated with terminal sequence motif (but the process is
    otherwise identical to =recentLTRs=).

    #+BEGIN_SRC groovy :tangle ../main.nf
      process olderLTRs {
        container 'robsyme/nf-repeatmasking'
        cache 'deep'

        input:
        file 'genome.fasta' from reference
        file 'eukaryotic-tRNAs.fasta.gz' from trnanuc

        output:
        set age, 'seqfile.result' into ltrHarvestResultsOld
        set age, 'seqfile.result' into ltrHarvestResultsForExemplarOld
        set age, 'seqfile.outinner' into ltrHarvestInnerOld
        set age, 'seqfile.outinner' into outinnerForBlastXOld
        set age, 'CRL_Step2_Passed_Elements.fasta', 'Repeat_down*.fasta', 'Repeat_up*.fasta' into olderLTRs

        script:
        age = 'old'
        """
      gt suffixerator -db genome.fasta -indexname genome.fasta -tis -suf -lcp -des -ssp -dna

      gt ltrharvest \
       -index genome.fasta \
       -out seqfile.out \
       -outinner seqfile.outinner \
       -gff3 seqfile.gff \
       -minlenltr 100 \
       -maxlenltr 6000 \
       -mindistltr 1500 \
       -maxdistltr 25000 \
       -mintsd 5 \
       -maxtsd 5 \
       -vic 10 \
      > seqfile.result

      gt gff3 \
       -sort seqfile.gff \
      > seqfile.gff.sort

      zcat eukaryotic-tRNAs.fasta.gz > eukaryotic-tRNAs.fasta

      gt ltrdigest \
       -trnas eukaryotic-tRNAs.fasta \
       seqfile.gff.sort \
       genome.fasta \
      > seqfile.gff.dgt

      CRL_Step1.pl \
       --gff seqfile.gff.dgt

      CRL_Step2.pl \
       --step1 CRL_Step1_Passed_Elements.txt \
       --repeatfile seqfile.out \
       --resultfile seqfile.result \
       --sequencefile genome.fasta \
       --removed_repeats CRL_Step2_Passed_Elements.fasta
        """
      }
    #+END_SRC

