docs/overview.html

<div id="outline-container-orgafd5440" class="outline-3">
<h3 id="orgafd5440"><span class="section-number-3">2.3</span> Collection of relatively recent LTR retrotranposons</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The rationale for initial collection of recent LTR elements is
that these elements contain less nested insertions and mutations
as well as recombination, thus the chance for false positives is
relatively low. We use the ltrharvest command from <a href="http://genometools.org">genometools</a> to
collect potential LTR sequences with the following
characteristics:
</p>

<ul class="org-ul">
<li>Two terminal repeats which are &gt;= 99% similar, ranging from 100 bp tp 6000 bp</li>
<li>The two terminal repeats end with “TG…CA”</li>
<li>The size of entire element ranges from 1.5 kb to 25 kb</li>
<li>The element must be flanked by a 5bp TSD (target site duplication)</li>
<li>The TSD is within 10 bp from the end of the element</li>
</ul>

<p>
The results are then passed through <code>ltrdigest</code> (again, from
genometools) to retain only those elements with polypurine tract
(PPT) and primer binding site (PBS).
</p>

<p>
The <code>CRL_Step1</code> script ensures that at least 50% of the PPT or PBS
sequences are located in the internal regions and the distance
between LTR and PPT or PBS are no more than 20 bp.
</p>

<p>
The <code>CRL_Step2</code> script filters again. False positives due to gene
clusters may still linger in the output from <code>CRL_Step1</code>. These
instances will have alignable regions that extend past the LTR
boundary. We pull out the flanking sequence from the putative LTR,
and if the flanking sequence <i>also</i> aligns, we discard it.
</p>

<div class="org-src-container">
<pre class="src src-groovy">process recentLTRs {
  container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>
          cache <span style="color: #98be65;">'deep'</span>

  input:
  file <span style="color: #98be65;">'genome.fasta'</span> from reference
  file <span style="color: #98be65;">'eukaryotic-tRNAs.fasta.gz'</span> from trnanuc

  output:
  set age, <span style="color: #98be65;">'seqfile.result'</span> into ltrHarvestResultsNew
  set age, <span style="color: #98be65;">'seqfile.result'</span> into ltrHarvestResultsForExemplarNew
  set age, <span style="color: #98be65;">'seqfile.outinner'</span> into ltrHarvestInnerNew
  set age, <span style="color: #98be65;">'seqfile.outinner'</span> into outinnerForBlastXNew
  set age, <span style="color: #98be65;">'CRL_Step2_Passed_Elements.fasta'</span>, <span style="color: #98be65;">'Repeat_down*.fasta'</span>, <span style="color: #98be65;">'Repeat_up*.fasta'</span> into recentLTRs

  script:
  age = <span style="color: #98be65;">'new'</span>
  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">gt suffixerator -db genome.fasta -indexname genome.fasta -tis -suf -lcp -des -ssp -dna</span>

<span style="color: #98be65;">gt ltrharvest \</span>
<span style="color: #98be65;"> -index genome.fasta \</span>
<span style="color: #98be65;"> -out seqfile.out \</span>
<span style="color: #98be65;"> -outinner seqfile.outinner \</span>
<span style="color: #98be65;"> -gff3 seqfile.gff \</span>
<span style="color: #98be65;"> -minlenltr 100 \</span>
<span style="color: #98be65;"> -maxlenltr 6000 \</span>
<span style="color: #98be65;"> -mindistltr 1500 \</span>
<span style="color: #98be65;"> -maxdistltr 25000 \</span>
<span style="color: #98be65;"> -mintsd 5 \</span>
<span style="color: #98be65;"> -maxtsd 5 \</span>
<span style="color: #98be65;"> -motif tgca \</span>
<span style="color: #98be65;"> -similar 99 \</span>
<span style="color: #98be65;"> -vic 10 \</span>
<span style="color: #98be65;">&gt; seqfile.result</span>

<span style="color: #98be65;">gt gff3 \</span>
<span style="color: #98be65;"> -sort seqfile.gff \</span>
<span style="color: #98be65;">&gt; seqfile.gff.sort</span>

<span style="color: #98be65;">zcat eukaryotic-tRNAs.fasta.gz &gt; eukaryotic-tRNAs.fasta</span>

<span style="color: #98be65;">gt ltrdigest \</span>
<span style="color: #98be65;"> -trnas eukaryotic-tRNAs.fasta \</span>
<span style="color: #98be65;"> seqfile.gff.sort \</span>
<span style="color: #98be65;"> genome.fasta \</span>
<span style="color: #98be65;">&gt; seqfile.gff.dgt</span>

<span style="color: #98be65;">CRL_Step1.pl \</span>
<span style="color: #98be65;"> --gff seqfile.gff.dgt</span>

<span style="color: #98be65;">CRL_Step2.pl \</span>
<span style="color: #98be65;"> --step1 CRL_Step1_Passed_Elements.txt \</span>
<span style="color: #98be65;"> --repeatfile seqfile.out \</span>
<span style="color: #98be65;"> --resultfile seqfile.result \</span>
<span style="color: #98be65;"> --sequencefile genome.fasta \</span>
<span style="color: #98be65;"> --removed_repeats CRL_Step2_Passed_Elements.fasta</span>
<span style="color: #98be65;">  """</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org57db473" class="outline-3">
<h3 id="org57db473"><span class="section-number-3">2.4</span> Collection of relatively old LTR retrotransposons</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Collection of relatively old LTRs is enabled by reducing the
similarity between LTRs to 85% (default value of LTRharvest) and
not associated with terminal sequence motif (but the process is
otherwise identical to <code>recentLTRs</code>).
</p>

<div class="org-src-container">
<pre class="src src-groovy">process olderLTRs {
  container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>
          cache <span style="color: #98be65;">'deep'</span>

  input:
  file <span style="color: #98be65;">'genome.fasta'</span> from reference
  file <span style="color: #98be65;">'eukaryotic-tRNAs.fasta.gz'</span> from trnanuc

  output:
  set age, <span style="color: #98be65;">'seqfile.result'</span> into ltrHarvestResultsOld
  set age, <span style="color: #98be65;">'seqfile.result'</span> into ltrHarvestResultsForExemplarOld
  set age, <span style="color: #98be65;">'seqfile.outinner'</span> into ltrHarvestInnerOld
  set age, <span style="color: #98be65;">'seqfile.outinner'</span> into outinnerForBlastXOld
  set age, <span style="color: #98be65;">'CRL_Step2_Passed_Elements.fasta'</span>, <span style="color: #98be65;">'Repeat_down*.fasta'</span>, <span style="color: #98be65;">'Repeat_up*.fasta'</span> into olderLTRs

  script:
  age = <span style="color: #98be65;">'old'</span>
  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">gt suffixerator -db genome.fasta -indexname genome.fasta -tis -suf -lcp -des -ssp -dna</span>

<span style="color: #98be65;">gt ltrharvest \</span>
<span style="color: #98be65;"> -index genome.fasta \</span>
<span style="color: #98be65;"> -out seqfile.out \</span>
<span style="color: #98be65;"> -outinner seqfile.outinner \</span>
<span style="color: #98be65;"> -gff3 seqfile.gff \</span>
<span style="color: #98be65;"> -minlenltr 100 \</span>
<span style="color: #98be65;"> -maxlenltr 6000 \</span>
<span style="color: #98be65;"> -mindistltr 1500 \</span>
<span style="color: #98be65;"> -maxdistltr 25000 \</span>
<span style="color: #98be65;"> -mintsd 5 \</span>
<span style="color: #98be65;"> -maxtsd 5 \</span>
<span style="color: #98be65;"> -vic 10 \</span>
<span style="color: #98be65;">&gt; seqfile.result</span>

<span style="color: #98be65;">gt gff3 \</span>
<span style="color: #98be65;"> -sort seqfile.gff \</span>
<span style="color: #98be65;">&gt; seqfile.gff.sort</span>

<span style="color: #98be65;">zcat eukaryotic-tRNAs.fasta.gz &gt; eukaryotic-tRNAs.fasta</span>

<span style="color: #98be65;">gt ltrdigest \</span>
<span style="color: #98be65;"> -trnas eukaryotic-tRNAs.fasta \</span>
<span style="color: #98be65;"> seqfile.gff.sort \</span>
<span style="color: #98be65;"> genome.fasta \</span>
<span style="color: #98be65;">&gt; seqfile.gff.dgt</span>

<span style="color: #98be65;">CRL_Step1.pl \</span>
<span style="color: #98be65;"> --gff seqfile.gff.dgt</span>

<span style="color: #98be65;">CRL_Step2.pl \</span>
<span style="color: #98be65;"> --step1 CRL_Step1_Passed_Elements.txt \</span>
<span style="color: #98be65;"> --repeatfile seqfile.out \</span>
<span style="color: #98be65;"> --resultfile seqfile.result \</span>
<span style="color: #98be65;"> --sequencefile genome.fasta \</span>
<span style="color: #98be65;"> --removed_repeats CRL_Step2_Passed_Elements.fasta</span>
<span style="color: #98be65;">  """</span>
}
</pre>
</div>
</div>
</div>
