docs/overview.org
** Cleaning LTR results

    LTRs (both new and old) identified above will almost certainly
    include false positives that need to be removed. The most common
    errors are:

    - Tandem local repeats (such as centromeric repeats)
    - Local gene clusters derived from gene duplications

    In the case of genuine LTRs, the insertion site will differ
    between LTR instances. The result is that alignment between two
    instances will not extend past the borders of the terminal repeat
    regions. In false positive instances like the examples above, the
    alignability of the instances may extend past the terminal
    repeats. :TODO: Present dot-plot examples of true and false LTRs.

    The outupt of this process (=CRL_Step3_Passed_Elements.fasta=) is
    a FASTA file containing element sequences that have passed the
    percent identity (60%) and number of identical nucleotides
    thresholds.

    #+BEGIN_SRC groovy :tangle ../main.nf
      ltrs = recentLTRs.mix(olderLTRs)
      ltrHarvestResults = ltrHarvestResultsOld.mix(ltrHarvestResultsNew)
      ltrHarvestInner = ltrHarvestInnerOld.mix(ltrHarvestInnerNew)
      outinnerForBlastX = outinnerForBlastXOld.mix(outinnerForBlastXNew)
      ltrHarvestResultsForExemplar = ltrHarvestResultsForExemplarOld.mix(ltrHarvestResultsForExemplarNew)
    #+END_SRC

    #+BEGIN_SRC groovy :tangle ../main.nf
      process CRL_Step3 {
        container 'robsyme/nf-repeatmasking'
        tag { age }

        input:
        set age, 'CRL_Step2_Passed_Elements.fasta', 'Repeat_down*.fasta', 'Repeat_up*.fasta' from ltrs

        output:
        set age, 'CRL_Step3_Passed_Elements.fasta' into step3Passed
        set age, 'CRL_Step3_Passed_Elements.fasta' into step3PassedForExemplars

        """
      CRL_Step3.pl \
       --directory . \
       --step2 CRL_Step2_Passed_Elements.fasta \
       --pidentity 60 \
       --seq_c 25
        """
      }
    #+END_SRC

    Retrotranposons are frequently nested with each other or inserted
    by other elements. If left unidentified, it will cause
    misclassification and other complications. To detect those
    elements, LTR sequences from candidate elements retained after
    steps in 2.1.3 are used to mask the putative internal regions. If
    LTR sequences are detected in the internal regions, it is
    considered as elements nested with other insertions.

    The internal regions of elements are also used to search against
    a transposase database of DNA transposons. If the internal
    sequence has significant matches with any DNA transposase, it is
    considered as an element containing nested insertions.

    This process produces =lLTR_Only.lib=, a FASTA file containing
    the sequence of the left (5'end) LTR sequence.

    #+BEGIN_SRC groovy :tangle ../main.nf
      ltrHarvestResults
      .combine(step3Passed, by: 0)
      .set { nestedInput }

      process identifyNestedInsetions {
        container 'robsyme/nf-repeatmasking'
        tag { age }
        input:
        file 'genome.fasta' from reference
        set age, 'seqfile.result', 'CRL_Step3_Passed_Elements.fasta' from nestedInput

        output:
        set age, 'repeats_to_mask_LTR.fasta' into repeatsToMaskLTR

        """
      ltr_library.pl \
       --resultfile seqfile.result \
       --step3 CRL_Step3_Passed_Elements.fasta \
       --sequencefile genome.fasta
      cat lLTR_Only.lib \
      | awk 'BEGIN {RS = ">" ; FS = "\\n" ; ORS = ""} \$2 {print ">"\$0}' \
      > repeats_to_mask_LTR.fasta
        """
      }
    #+END_SRC

