docs/overview.html

<div id="outline-container-orgbe302cb" class="outline-3">
<h3 id="orgbe302cb"><span class="section-number-3">2.5</span> Cleaning LTR results</h3>
<div class="outline-text-3" id="text-2-5">
<p>
LTRs (both new and old) identified above will almost certainly
include false positives that need to be removed. The most common
errors are:
</p>

<ul class="org-ul">
<li>Tandem local repeats (such as centromeric repeats)</li>
<li>Local gene clusters derived from gene duplications</li>
</ul>

<p>
In the case of genuine LTRs, the insertion site will differ
between LTR instances. The result is that alignment between two
instances will not extend past the borders of the terminal repeat
regions. In false positive instances like the examples above, the
alignability of the instances may extend past the terminal
repeats. :TODO: Present dot-plot examples of true and false LTRs.
</p>

<p>
The outupt of this process (<code>CRL_Step3_Passed_Elements.fasta</code>) is
a FASTA file containing element sequences that have passed the
percent identity (60%) and number of identical nucleotides
thresholds.
</p>

<div class="org-src-container">
<pre class="src src-groovy">ltrs = recentLTRs.mix(olderLTRs)
ltrHarvestResults = ltrHarvestResultsOld.mix(ltrHarvestResultsNew)
ltrHarvestInner = ltrHarvestInnerOld.mix(ltrHarvestInnerNew)
outinnerForBlastX = outinnerForBlastXOld.mix(outinnerForBlastXNew)
ltrHarvestResultsForExemplar = ltrHarvestResultsForExemplarOld.mix(ltrHarvestResultsForExemplarNew)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-groovy">process CRL_Step3 {
  container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>
  tag { age }

  input:
  set age, <span style="color: #98be65;">'CRL_Step2_Passed_Elements.fasta'</span>, <span style="color: #98be65;">'Repeat_down*.fasta'</span>, <span style="color: #98be65;">'Repeat_up*.fasta'</span> from ltrs

  output:
  set age, <span style="color: #98be65;">'CRL_Step3_Passed_Elements.fasta'</span> into step3Passed
  set age, <span style="color: #98be65;">'CRL_Step3_Passed_Elements.fasta'</span> into step3PassedForExemplars

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">CRL_Step3.pl \</span>
<span style="color: #98be65;"> --directory . \</span>
<span style="color: #98be65;"> --step2 CRL_Step2_Passed_Elements.fasta \</span>
<span style="color: #98be65;"> --pidentity 60 \</span>
<span style="color: #98be65;"> --seq_c 25</span>
<span style="color: #98be65;">  """</span>
}
</pre>
</div>

<p>
Retrotranposons are frequently nested with each other or inserted
by other elements. If left unidentified, it will cause
misclassification and other complications. To detect those
elements, LTR sequences from candidate elements retained after
steps in 2.1.3 are used to mask the putative internal regions. If
LTR sequences are detected in the internal regions, it is
considered as elements nested with other insertions.
</p>

<p>
The internal regions of elements are also used to search against
a transposase database of DNA transposons. If the internal
sequence has significant matches with any DNA transposase, it is
considered as an element containing nested insertions.
</p>

<p>
This process produces <code>lLTR_Only.lib</code>, a FASTA file containing
the sequence of the left (5'end) LTR sequence.
</p>

<div class="org-src-container">
<pre class="src src-groovy">ltrHarvestResults
.combine(step3Passed, by: 0)
.set { nestedInput }

process identifyNestedInsetions {
  container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>
  tag { age }
  input:
  file <span style="color: #98be65;">'genome.fasta'</span> from reference
  set age, <span style="color: #98be65;">'seqfile.result'</span>, <span style="color: #98be65;">'CRL_Step3_Passed_Elements.fasta'</span> from nestedInput

  output:
  set age, <span style="color: #98be65;">'repeats_to_mask_LTR.fasta'</span> into repeatsToMaskLTR

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">ltr_library.pl \</span>
<span style="color: #98be65;"> --resultfile seqfile.result \</span>
<span style="color: #98be65;"> --step3 CRL_Step3_Passed_Elements.fasta \</span>
<span style="color: #98be65;"> --sequencefile genome.fasta</span>
<span style="color: #98be65;">cat lLTR_Only.lib \</span>
<span style="color: #98be65;">| awk 'BEGIN {RS = "&gt;" ; FS = "\\n" ; ORS = ""} \$2 {print "&gt;"\$0}' \</span>
<span style="color: #98be65;">&gt; repeats_to_mask_LTR.fasta</span>
<span style="color: #98be65;">  """</span>
}
</pre>
</div>
</div>
</div>
