docs/overview.org
** Identify elements with nested insertions

   Retrotranposons are frequently nested with each other or inserted
   by other elements. If left unidentified, it will cause
   misclassification and other complications. To detect those
   elements, LTR sequences from candidate elements retained after
   steps in == are used to mask the putative internal regions. If
   LTR sequences are detected in the internal regions, it is
   considered as elements nested with other insertions.

   #+BEGIN_SRC groovy :tangle ../main.nf
     process RepeatMasker1 {
       container 'robsyme/nf-repeatmasking'
       tag { age }

       input:
       set age, 'repeats_to_mask_LTR.fasta', 'seqfile.outinner' from repeatsToMaskLTR.combine(ltrHarvestInner, by: 0)

       output:
       set age, 'seqfile.outinner.out', 'seqfile.outinner.masked' into repeatMasker1Unclean

       """
     RepeatMasker \
      -lib repeats_to_mask_LTR.fasta \
      -nolow \
      -no_is \
      -dir . \
      seqfile.outinner

     if [ ! -f seqfile.outinner.masked ]; then
       cp seqfile.outinner seqfile.outinner.masked
     fi
       """
     }
   #+END_SRC

   #+BEGIN_SRC groovy :tangle ../main.nf
     process cleanRM {
       tag { age }

       input:
       set age, 'seqfile.outinner.out', 'seqfile.outinner.masked' from repeatMasker1Unclean

       output:
       set age, 'seqfile.outinner.clean' into repeatMasker1Clean

       """
     cleanRM.pl seqfile.outinner.out seqfile.outinner.masked > seqfile.outinner.unmasked
     rmshortinner.pl seqfile.outinner.unmasked 50 > seqfile.outinner.clean
       """
     }
   #+END_SRC

   #+BEGIN_SRC groovy :tangle ../main.nf
     process blastX {
       container 'robsyme/nf-repeatmasking'
       tag { age }
       cpus 4

       input:
       file 'Tpases020812DNA.fasta.gz' from trnaprot
       set age, 'seqfile.outinner.clean', 'seqfile.outinner' from repeatMasker1Clean.combine(outinnerForBlastX, by: 0)

       output:
       set age, 'passed_outinner_sequence.fasta' into blastxPassed

       """
     zcat Tpases020812DNA.fasta.gz > Tpases020812DNA.fasta
     makeblastdb -in Tpases020812DNA.fasta -dbtype prot
     blastx \
      -query seqfile.outinner.clean \
      -db Tpases020812DNA.fasta \
      -evalue 1e-20 \
      -num_descriptions 10 \
      -num_threads ${task.cpus} \
      -out seqfile.outinner.clean_blastx.out.txt

     outinner_blastx_parse.pl \
      --blastx seqfile.outinner.clean_blastx.out.txt \
      --outinner seqfile.outinner

     if [ ! -s passed_outinner_sequence.fasta ]; then
       echo -e '>dummy empty sequence\nACTACTAC' > passed_outinner_sequence.fasta
     fi
       """
     }
   #+END_SRC

   #+BEGIN_SRC groovy :tangle ../main.nf
     blastxPassed
     .combine(step3PassedForExemplars, by: 0)
     .combine(ltrHarvestResultsForExemplar, by: 0)
     .set { forExemplarBuilding }

     process buildExemplars {
       container 'robsyme/nf-repeatmasking'
       tag { age }
       cpus 4

       input:
       file 'genome.fasta' from reference
       set age, 'passed_outinner_sequence.fasta', 'CRL_Step3_Passed_Elements.fasta', 'seqfile.result' from forExemplarBuilding

       output:
       set age, 'LTR.lib' into exemplars

       """
     CRL_Step4.pl \
      --step3 CRL_Step3_Passed_Elements.fasta \
      --resultfile seqfile.result \
      --innerfile passed_outinner_sequence.fasta \
      --sequencefile genome.fasta

     for lib in lLTRs_Seq_For_BLAST.fasta Inner_Seq_For_BLAST.fasta; do
       makeblastdb -in \$lib -dbtype nucl
       blastn \
        -query \${lib} \
        -db \${lib} \
        -evalue 1e-10 \
        -num_threads ${task.cpus} \
        -num_descriptions 1000 \
        -out \${lib}.out
     done

     CRL_Step5.pl \
      --LTR_blast lLTRs_Seq_For_BLAST.fasta.out \
      --inner_blast Inner_Seq_For_BLAST.fasta.out \
      --step3 CRL_Step3_Passed_Elements.fasta \
      --final LTR.lib \
      --pcoverage 90 \
      --pidentity 80
       """
     }
   #+END_SRC

   Since the set of older LTR elements contain elements from the
   newer LTR set, the exemplar sequences need to be masked by
   LTR99.lib and all elements that are significantly masked (cutoff
   at 80% identity in 90% of the element length) are excluded.

   #+BEGIN_SRC groovy :tangle ../main.nf
     newLTRs = Channel.create()
     oldLTRs = Channel.create()

     exemplars
     .choice( newLTRs, oldLTRs ) { it[0] == "new" ? 0 : 1 }

     process removeDuplicates {
       container 'robsyme/nf-repeatmasking'

       input:
       set _, 'ltrs.new.fasta' from newLTRs
       set _, 'ltrs.old.fasta' from oldLTRs

       output:
       set 'ltrs.old.fasta.masked', 'ltrs.new.fasta' into bothLTRforMasking

       "RepeatMasker -lib ltrs.new.fasta -dir . ltrs.old.fasta"
     }

     process filterOldLTRs {
       container 'robsyme/nf-repeatmasking'

       input:
       set 'ltrs.old.fasta.masked', 'ltrs.new.fasta' from bothLTRforMasking

       output:
       file 'allLTRs.fasta' into allLTR

       """
     remove_masked_sequence.pl \
     --masked_elements ltrs.old.fasta.masked \
     --outfile ltrs.old.final.fasta
     cat ltrs.new.fasta ltrs.old.final.fasta > allLTRs.fasta
       """
     }
   #+END_SRC

   #+BEGIN_SRC groovy :tangle ../main.nf
     allLTR
     .splitFasta(record: [id: true, sequence: true ])
     .collectFile( name: 'allLTRs.fasta' ) { ">" + it.id + "#LTR\n" + it.sequence }
     .tap { allLTR2 }
     .set { inputForRM2 }

     process RepeatMasker2 {
       container 'robsyme/nf-repeatmasking'
       cpus 10

       input:
       file 'genome.fasta' from reference
       file 'allLTR.lib' from inputForRM2

       output:
       file 'genome.fasta.masked' into genomeLtrMasked

       """
     RepeatMasker \
      -no_is \
      -nolow \
      -pa ${task.cpus} \
      -lib allLTR.lib \
      -dir . \
      genome.fasta
       """
     }
   #+END_SRC

   #+BEGIN_SRC groovy :tangle ../main.nf
     process RepeatModeler {
       container 'robsyme/nf-repeatmasking'
       cpus 4

       input:
       file 'genome.masked' from genomeLtrMasked

       output:
       file 'consensi.fa.classified' into rmOutput

       """
     rmaskedpart.pl genome.masked 50 | sed '/^\$/d' > umseqfile
     BuildDatabase -name umseqfiledb -engine ncbi umseqfile
     RepeatModeler -pa ${task.cpus} -database umseqfiledb >& umseqfile.out
     mv RM*/consensi.fa.classified consensi.fa.classified
       """
     }
   #+END_SRC

   #+BEGIN_SRC groovy :tangle ../main.nf
         identityUnknown = Channel.create()
         identityKnown = Channel.create()

         rmOutput
         .splitFasta(record: [id: true, text: true])
         .choice(identityUnknown, identityKnown) { record -> record.id =~ /#Unknown/ ? 0 : 1 }

         identityUnknown
         .collectFile() { record -> ['unknown.fasta', record.text] }
         .set { repeatmaskerUnknowns }

         identityKnown
         .collectFile() { record -> ['known.fasta', record.text] }
         .tap { repeatmaskerKnowns1 }
         .set{ repeatmaskerKnowns }
   #+END_SRC

   We'd like to get a better idea about what these 'unknown elements'
   are. It's possible that they are known transposons that have been
   RIPped beyond recognition. To retrieve these, we can pull out an
   ailgnment of these repeat instances (with RepeatMasker), run [[https://bmcgenomics.biomedcentral.com/articles/10.1186/1471-2164-11-655][DeRIP]]
   over each alignment and then push them back into the identification
   pipeline (RepeatModeler classify script).

   #+BEGIN_SRC groovy :tangle ../main.nf
         process searchForUnidentifiedElements {
           container 'robsyme/nf-repeatmasking'

           input:
           file 'genome.fasta' from reference
           file 'unknown_elements.fasta' from repeatmaskerKnowns1

           output:
           set 'genome.fasta.align', 'unknown_elements.fasta' into unknownAlignments

           """
         RepeatMasker \
          -lib unknown_elements.fasta \
          -alignments \
          -nolow \
          -no_is \
          -dir . \
          -inv \
          genome.fasta
           """
         }

         process derip {
           container 'robsyme/nf-repeatmasking'

           input:
           set 'genome.fasta.align', 'unknown_elements.fasta' from unknownAlignments

           output:
           file 'deripped.unknowns.fasta' into derippedUnknowns

           """
           rmalignment_to_fasta.rb genome.fasta.align unknown_elements.fasta
           for file in alignment*; do
             derip.rb \$file
           done > deripped.unknowns.fasta
           """
         }

         process classifyDeripped {
       container 'repeats'

           input:
       file 'transposases.fasta.gz' from trnaprot
           file 'repeatmodeler_unknowns.deripped.fasta' from derippedUnknowns

       output:
       file 'identified_elements.txt' into identifiedDerippedTransposons
           file 'unknown_elements.txt' into unidentifiedDerippedTransposons

           """
     zcat transposases.fasta.gz > transposases.fasta
     makeblastdb \
      -in transposases.fasta \
      -dbtype prot
     blastx \
      -query repeatmodeler_unknowns.deripped.fasta \
      -db transposases.fasta \
      -evalue 1e-10 \
      -num_descriptions 10 \
      -num_threads ${task.cpus} \
      -out modelerunknown_blast_results.txt
     transposon_blast_parse.pl \
      --blastx modelerunknown_blast_results.txt \
      --modelerunknown repeatmodeler_unknowns.deripped.fasta
           """
         }

         identifiedDerippedTransposons.subscribe{ println("Identified, deripped: ${it}") }

   #+END_SRC

   #+BEGIN_SRC groovy :tangle ../main.nf
     process transposonBlast {
       container 'robsyme/nf-repeatmasking'
       cpus 4

       input:
       file 'transposases.fasta.gz' from trnaprot
       file 'repeatmodeler_unknowns.fasta' from repeatmaskerUnknowns

       output:
       file 'identified_elements.txt' into identifiedTransposons
           file 'unknown_elements.txt' into unidentifiedTransposons

       """
     zcat transposases.fasta.gz > transposases.fasta
     makeblastdb \
      -in transposases.fasta \
      -dbtype prot
     blastx \
      -query repeatmodeler_unknowns.fasta \
      -db transposases.fasta \
      -evalue 1e-10 \
      -num_descriptions 10 \
      -num_threads ${task.cpus} \
      -out modelerunknown_blast_results.txt
     transposon_blast_parse.pl \
      --blastx modelerunknown_blast_results.txt \
      --modelerunknown repeatmodeler_unknowns.fasta
       """
     }

   #+END_SRC

