docs/overview.html

<div id="outline-container-orgcae4ec4" class="outline-3">
<h3 id="orgcae4ec4"><span class="section-number-3">2.6</span> Identify elements with nested insertions</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Retrotranposons are frequently nested with each other or inserted
by other elements. If left unidentified, it will cause
misclassification and other complications. To detect those
elements, LTR sequences from candidate elements retained after
steps in == are used to mask the putative internal regions. If
LTR sequences are detected in the internal regions, it is
considered as elements nested with other insertions.
</p>

<div class="org-src-container">
<pre class="src src-groovy">process <span style="color: #ECBE7B;">RepeatMasker1</span> {
  container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>
  tag { age }

  input:
  set age, <span style="color: #98be65;">'repeats_to_mask_LTR.fasta'</span>, <span style="color: #98be65;">'seqfile.outinner'</span> from repeatsToMaskLTR.combine(ltrHarvestInner, by: 0)

  output:
  set age, <span style="color: #98be65;">'seqfile.outinner.out'</span>, <span style="color: #98be65;">'seqfile.outinner.masked'</span> into repeatMasker1Unclean

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">RepeatMasker \</span>
<span style="color: #98be65;"> -lib repeats_to_mask_LTR.fasta \</span>
<span style="color: #98be65;"> -nolow \</span>
<span style="color: #98be65;"> -no_is \</span>
<span style="color: #98be65;"> -dir . \</span>
<span style="color: #98be65;"> seqfile.outinner</span>

<span style="color: #98be65;">if [ ! -f seqfile.outinner.masked ]; then</span>
<span style="color: #98be65;">  cp seqfile.outinner seqfile.outinner.masked</span>
<span style="color: #98be65;">fi</span>
<span style="color: #98be65;">  """</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-groovy">process cleanRM {
  tag { age }

  input:
  set age, <span style="color: #98be65;">'seqfile.outinner.out'</span>, <span style="color: #98be65;">'seqfile.outinner.masked'</span> from repeatMasker1Unclean

  output:
  set age, <span style="color: #98be65;">'seqfile.outinner.clean'</span> into repeatMasker1Clean

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">cleanRM.pl seqfile.outinner.out seqfile.outinner.masked &gt; seqfile.outinner.unmasked</span>
<span style="color: #98be65;">rmshortinner.pl seqfile.outinner.unmasked 50 &gt; seqfile.outinner.clean</span>
<span style="color: #98be65;">  """</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-groovy">process blastX {
  container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>
  tag { age }
  cpus 4

  input:
  file <span style="color: #98be65;">'Tpases020812DNA.fasta.gz'</span> from trnaprot
  set age, <span style="color: #98be65;">'seqfile.outinner.clean'</span>, <span style="color: #98be65;">'seqfile.outinner'</span> from repeatMasker1Clean.combine(outinnerForBlastX, by: 0)

  output:
  set age, <span style="color: #98be65;">'passed_outinner_sequence.fasta'</span> into blastxPassed

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">zcat Tpases020812DNA.fasta.gz &gt; Tpases020812DNA.fasta</span>
<span style="color: #98be65;">makeblastdb -in Tpases020812DNA.fasta -dbtype prot</span>
<span style="color: #98be65;">blastx \</span>
<span style="color: #98be65;"> -query seqfile.outinner.clean \</span>
<span style="color: #98be65;"> -db Tpases020812DNA.fasta \</span>
<span style="color: #98be65;"> -evalue 1e-20 \</span>
<span style="color: #98be65;"> -num_descriptions 10 \</span>
<span style="color: #98be65;"> -num_threads </span><span style="color: #dcaeea;">${task.cpus}</span><span style="color: #98be65;"> \</span>
<span style="color: #98be65;"> -out seqfile.outinner.clean_blastx.out.txt</span>

<span style="color: #98be65;">outinner_blastx_parse.pl \</span>
<span style="color: #98be65;"> --blastx seqfile.outinner.clean_blastx.out.txt \</span>
<span style="color: #98be65;"> --outinner seqfile.outinner</span>

<span style="color: #98be65;">if [ ! -s passed_outinner_sequence.fasta ]; then</span>
<span style="color: #98be65;">  echo -e '&gt;dummy empty sequence\nACTACTAC' &gt; passed_outinner_sequence.fasta</span>
<span style="color: #98be65;">fi</span>
<span style="color: #98be65;">  """</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-groovy">blastxPassed
.combine(step3PassedForExemplars, by: 0)
.combine(ltrHarvestResultsForExemplar, by: 0)
.set { forExemplarBuilding }

process buildExemplars {
  container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>
  tag { age }
  cpus 4

  input:
  file <span style="color: #98be65;">'genome.fasta'</span> from reference
  set age, <span style="color: #98be65;">'passed_outinner_sequence.fasta'</span>, <span style="color: #98be65;">'CRL_Step3_Passed_Elements.fasta'</span>, <span style="color: #98be65;">'seqfile.result'</span> from forExemplarBuilding

  output:
  set age, <span style="color: #98be65;">'LTR.lib'</span> into exemplars

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">CRL_Step4.pl \</span>
<span style="color: #98be65;"> --step3 CRL_Step3_Passed_Elements.fasta \</span>
<span style="color: #98be65;"> --resultfile seqfile.result \</span>
<span style="color: #98be65;"> --innerfile passed_outinner_sequence.fasta \</span>
<span style="color: #98be65;"> --sequencefile genome.fasta</span>

<span style="color: #98be65;">for lib in lLTRs_Seq_For_BLAST.fasta Inner_Seq_For_BLAST.fasta; do</span>
<span style="color: #98be65;">  makeblastdb -in \$lib -dbtype nucl</span>
<span style="color: #98be65;">  blastn \</span>
<span style="color: #98be65;">   -query \${lib} \</span>
<span style="color: #98be65;">   -db \${lib} \</span>
<span style="color: #98be65;">   -evalue 1e-10 \</span>
<span style="color: #98be65;">   -num_threads </span><span style="color: #dcaeea;">${task.cpus}</span><span style="color: #98be65;"> \</span>
<span style="color: #98be65;">   -num_descriptions 1000 \</span>
<span style="color: #98be65;">   -out \${lib}.out</span>
<span style="color: #98be65;">done</span>

<span style="color: #98be65;">CRL_Step5.pl \</span>
<span style="color: #98be65;"> --LTR_blast lLTRs_Seq_For_BLAST.fasta.out \</span>
<span style="color: #98be65;"> --inner_blast Inner_Seq_For_BLAST.fasta.out \</span>
<span style="color: #98be65;"> --step3 CRL_Step3_Passed_Elements.fasta \</span>
<span style="color: #98be65;"> --final LTR.lib \</span>
<span style="color: #98be65;"> --pcoverage 90 \</span>
<span style="color: #98be65;"> --pidentity 80</span>
<span style="color: #98be65;">  """</span>
}
</pre>
</div>

<p>
Since the set of older LTR elements contain elements from the
newer LTR set, the exemplar sequences need to be masked by
LTR99.lib and all elements that are significantly masked (cutoff
at 80% identity in 90% of the element length) are excluded.
</p>

<div class="org-src-container">
<pre class="src src-groovy">newLTRs = <span style="color: #ECBE7B;">Channel</span>.create()
oldLTRs = <span style="color: #ECBE7B;">Channel</span>.create()

exemplars
.choice( newLTRs, oldLTRs ) { <span style="color: #dcaeea;">it</span>[0] == <span style="color: #98be65;">"new"</span> ? 0 : 1 }

process removeDuplicates {
  container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>

  input:
  set _, <span style="color: #98be65;">'ltrs.new.fasta'</span> from newLTRs
  set _, <span style="color: #98be65;">'ltrs.old.fasta'</span> from oldLTRs

  output:
  set <span style="color: #98be65;">'ltrs.old.fasta.masked'</span>, <span style="color: #98be65;">'ltrs.new.fasta'</span> into bothLTRforMasking

  <span style="color: #98be65;">"RepeatMasker -lib ltrs.new.fasta -dir . ltrs.old.fasta"</span>
}

process filterOldLTRs {
  container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>

  input:
  set <span style="color: #98be65;">'ltrs.old.fasta.masked'</span>, <span style="color: #98be65;">'ltrs.new.fasta'</span> from bothLTRforMasking

  output:
  file <span style="color: #98be65;">'allLTRs.fasta'</span> into allLTR

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">remove_masked_sequence.pl \</span>
<span style="color: #98be65;">--masked_elements ltrs.old.fasta.masked \</span>
<span style="color: #98be65;">--outfile ltrs.old.final.fasta</span>
<span style="color: #98be65;">cat ltrs.new.fasta ltrs.old.final.fasta &gt; allLTRs.fasta</span>
<span style="color: #98be65;">  """</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-groovy">allLTR
.splitFasta(record: [id: <span style="color: #a9a1e1;">true</span>, sequence: <span style="color: #a9a1e1;">true</span> ])
.collectFile( name: <span style="color: #98be65;">'allLTRs.fasta'</span> ) { <span style="color: #98be65;">"&gt;"</span> + <span style="color: #dcaeea;">it</span>.id + <span style="color: #98be65;">"#LTR\n"</span> + <span style="color: #dcaeea;">it</span>.sequence }
.tap { allLTR2 }
.set { inputForRM2 }

process <span style="color: #ECBE7B;">RepeatMasker2</span> {
  container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>
  cpus 10

  input:
  file <span style="color: #98be65;">'genome.fasta'</span> from reference
  file <span style="color: #98be65;">'allLTR.lib'</span> from inputForRM2

  output:
  file <span style="color: #98be65;">'genome.fasta.masked'</span> into genomeLtrMasked

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">RepeatMasker \</span>
<span style="color: #98be65;"> -no_is \</span>
<span style="color: #98be65;"> -nolow \</span>
<span style="color: #98be65;"> -pa </span><span style="color: #dcaeea;">${task.cpus}</span><span style="color: #98be65;"> \</span>
<span style="color: #98be65;"> -lib allLTR.lib \</span>
<span style="color: #98be65;"> -dir . \</span>
<span style="color: #98be65;"> genome.fasta</span>
<span style="color: #98be65;">  """</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-groovy">process <span style="color: #ECBE7B;">RepeatModeler</span> {
  container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>
  cpus 4

  input:
  file <span style="color: #98be65;">'genome.masked'</span> from genomeLtrMasked

  output:
  file <span style="color: #98be65;">'consensi.fa.classified'</span> into rmOutput

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">rmaskedpart.pl genome.masked 50 | sed '/^\$/d' &gt; umseqfile</span>
<span style="color: #98be65;">BuildDatabase -name umseqfiledb -engine ncbi umseqfile</span>
<span style="color: #98be65;">RepeatModeler -pa </span><span style="color: #dcaeea;">${task.cpus}</span><span style="color: #98be65;"> -database umseqfiledb &gt;&amp; umseqfile.out</span>
<span style="color: #98be65;">mv RM*/consensi.fa.classified consensi.fa.classified</span>
<span style="color: #98be65;">  """</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-groovy">identityUnknown = <span style="color: #ECBE7B;">Channel</span>.create()
identityKnown = <span style="color: #ECBE7B;">Channel</span>.create()

rmOutput
.splitFasta(record: [id: <span style="color: #a9a1e1;">true</span>, text: <span style="color: #a9a1e1;">true</span>])
.choice(identityUnknown, identityKnown) { record -&gt; record.id =~ <span style="color: #98be65;">/#Unknown/</span> ? 0 : 1 }

identityUnknown
.collectFile() { record -&gt; [<span style="color: #98be65;">'unknown.fasta'</span>, record.text] }
.set { repeatmaskerUnknowns }

identityKnown
.collectFile() { record -&gt; [<span style="color: #98be65;">'known.fasta'</span>, record.text] }
.tap { repeatmaskerKnowns1 }
.set{ repeatmaskerKnowns }
</pre>
</div>

<p>
We'd like to get a better idea about what these 'unknown elements'
are. It's possible that they are known transposons that have been
RIPped beyond recognition. To retrieve these, we can pull out an
ailgnment of these repeat instances (with RepeatMasker), run <a href="https://bmcgenomics.biomedcentral.com/articles/10.1186/1471-2164-11-655">DeRIP</a>
over each alignment and then push them back into the identification
pipeline (RepeatModeler classify script).
</p>

<div class="org-src-container">
<pre class="src src-groovy">    process searchForUnidentifiedElements {
      container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>

      input:
      file <span style="color: #98be65;">'genome.fasta'</span> from reference
      file <span style="color: #98be65;">'unknown_elements.fasta'</span> from repeatmaskerKnowns1

      output:
      set <span style="color: #98be65;">'genome.fasta.align'</span>, <span style="color: #98be65;">'unknown_elements.fasta'</span> into unknownAlignments

      <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">    RepeatMasker \</span>
<span style="color: #98be65;">     -lib unknown_elements.fasta \</span>
<span style="color: #98be65;">     -alignments \</span>
<span style="color: #98be65;">     -nolow \</span>
<span style="color: #98be65;">     -no_is \</span>
<span style="color: #98be65;">     -dir . \</span>
<span style="color: #98be65;">     -inv \</span>
<span style="color: #98be65;">     genome.fasta</span>
<span style="color: #98be65;">      """</span>
    }

    process derip {
      container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>

      input:
      set <span style="color: #98be65;">'genome.fasta.align'</span>, <span style="color: #98be65;">'unknown_elements.fasta'</span> from unknownAlignments

      output:
      file <span style="color: #98be65;">'deripped.unknowns.fasta'</span> into derippedUnknowns

      <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">      rmalignment_to_fasta.rb genome.fasta.align unknown_elements.fasta</span>
<span style="color: #98be65;">      for file in alignment*; do</span>
<span style="color: #98be65;">        derip.rb \$file</span>
<span style="color: #98be65;">      done &gt; deripped.unknowns.fasta</span>
<span style="color: #98be65;">      """</span>
    }

    process classifyDeripped {
  container <span style="color: #98be65;">'repeats'</span>

      input:
  file <span style="color: #98be65;">'transposases.fasta.gz'</span> from trnaprot
      file <span style="color: #98be65;">'repeatmodeler_unknowns.deripped.fasta'</span> from derippedUnknowns

  output:
  file <span style="color: #98be65;">'identified_elements.txt'</span> into identifiedDerippedTransposons
      file <span style="color: #98be65;">'unknown_elements.txt'</span> into unidentifiedDerippedTransposons

      <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">zcat transposases.fasta.gz &gt; transposases.fasta</span>
<span style="color: #98be65;">makeblastdb \</span>
<span style="color: #98be65;"> -in transposases.fasta \</span>
<span style="color: #98be65;"> -dbtype prot</span>
<span style="color: #98be65;">blastx \</span>
<span style="color: #98be65;"> -query repeatmodeler_unknowns.deripped.fasta \</span>
<span style="color: #98be65;"> -db transposases.fasta \</span>
<span style="color: #98be65;"> -evalue 1e-10 \</span>
<span style="color: #98be65;"> -num_descriptions 10 \</span>
<span style="color: #98be65;"> -num_threads </span><span style="color: #dcaeea;">${task.cpus}</span><span style="color: #98be65;"> \</span>
<span style="color: #98be65;"> -out modelerunknown_blast_results.txt</span>
<span style="color: #98be65;">transposon_blast_parse.pl \</span>
<span style="color: #98be65;"> --blastx modelerunknown_blast_results.txt \</span>
<span style="color: #98be65;"> --modelerunknown repeatmodeler_unknowns.deripped.fasta</span>
<span style="color: #98be65;">      """</span>
    }

    identifiedDerippedTransposons.subscribe{<span style="color: #51afef;"> println</span>(<span style="color: #98be65;">"Identified, deripped: </span><span style="color: #dcaeea;">${it}</span><span style="color: #98be65;">"</span>) }

</pre>
</div>

<div class="org-src-container">
<pre class="src src-groovy">process transposonBlast {
  container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>
  cpus 4

  input:
  file <span style="color: #98be65;">'transposases.fasta.gz'</span> from trnaprot
  file <span style="color: #98be65;">'repeatmodeler_unknowns.fasta'</span> from repeatmaskerUnknowns

  output:
  file <span style="color: #98be65;">'identified_elements.txt'</span> into identifiedTransposons
      file <span style="color: #98be65;">'unknown_elements.txt'</span> into unidentifiedTransposons

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">zcat transposases.fasta.gz &gt; transposases.fasta</span>
<span style="color: #98be65;">makeblastdb \</span>
<span style="color: #98be65;"> -in transposases.fasta \</span>
<span style="color: #98be65;"> -dbtype prot</span>
<span style="color: #98be65;">blastx \</span>
<span style="color: #98be65;"> -query repeatmodeler_unknowns.fasta \</span>
<span style="color: #98be65;"> -db transposases.fasta \</span>
<span style="color: #98be65;"> -evalue 1e-10 \</span>
<span style="color: #98be65;"> -num_descriptions 10 \</span>
<span style="color: #98be65;"> -num_threads </span><span style="color: #dcaeea;">${task.cpus}</span><span style="color: #98be65;"> \</span>
<span style="color: #98be65;"> -out modelerunknown_blast_results.txt</span>
<span style="color: #98be65;">transposon_blast_parse.pl \</span>
<span style="color: #98be65;"> --blastx modelerunknown_blast_results.txt \</span>
<span style="color: #98be65;"> --modelerunknown repeatmodeler_unknowns.fasta</span>
<span style="color: #98be65;">  """</span>
}

</pre>
</div>
</div>
</div>
