docs/overview.org
** Noncoding RNA

   We'll borrow the excellent ncRNA prediction steps from the
   excellent [[https://github.com/sanger-pathogens/companion][Companion annotation pipeline]].

   #+BEGIN_SRC groovy :tangle ../main.nf
         process predict_ncRNA {
           container 'sangerpathogens/companion:latest'

           input:
           file 'genome.fasta' from reference

           output:
           file 'cm_out' into cmtblouts

           """
         cp /opt/data/cm/rnas.cm models.cm
         cmpress -F models.cm
         cmsearch --cpu 1 --tblout cm_out --cut_ga models.cm genome.fasta
           """
         }

         process merge_ncrnas {
           container 'sangerpathogens/companion:latest'
           cache 'deep'

           input:
           file 'cmtblout' from cmtblouts

           output:
           file 'ncrna.gff3' into ncrnafile

           """
           infernal_to_gff3.lua < ${cmtblout} > 1
           gt gff3 -sort -tidy -retainids 1 > ncrna.gff3
           """
         }

         ncrnafile.println()
   #+END_SRC

** Final Masking

   #+BEGIN_SRC groovy :tangle ../main.nf
     repeatmaskerKnowns
     .mix(identifiedTransposons)
     .collectFile() { it.text }
     .combine(allLTR2)
     .set { knownRepeats }
   #+END_SRC

   #+BEGIN_SRC groovy :tangle ../main.nf
         process repeatMaskerKnowns {
           container 'robsyme/nf-repeatmasking'
           publishDir "${params.outdir}/repeatMaskerKnowns", mode: 'copy'

           input:
           file 'reference.fasta' from reference
           set 'knownTransposons.lib', 'allLTRs.lib' from knownRepeats

           output:
           set 'reference.fasta.out', 'reference.fasta.masked' into repeatMaskerKnownsMasked
           set 'reference.fasta.out.gff', 'knownRepeats.library.fasta'

           """
         cat *.lib > knownRepeats.library.fasta
         RepeatMasker \
          -lib knownRepeats.library.fasta \
          -nolow \
          -no_is \
          -dir . \
          -gff \
          -s \
          reference.fasta
           """
         }

         process removeShortMatches {
           container 'robsyme/nf-repeatmasking'
           publishDir "${params.outdir}/cleanMasked", mode: 'copy'

           input:
           file 'reference.fa' from reference
           set 'rm.out', 'rm.masked' from repeatMaskerKnownsMasked

           output:
           set 'rm.trimmed.out', 'rm.trimmed.masked' into repeatMaskerKnownsMaskedTrimmed

           """
         head -n 3 rm.out > rm.trimmed.out
         tail -n +4 rm.out | awk '\$7 - \$6 > ${params.minRepLength}' >> rm.trimmed.out
         tail -n +4 rm.out | awk 'BEGIN{OFS="\\t"} \$7 - \$6 > ${params.minRepLength} {print \$5, \$6, \$7}' >> rm.trimmed.bed
         maskFastaFromBed -fi reference.fa -bed rm.trimmed.bed -fo rm.trimmed.masked -soft
           """
         }
   #+END_SRC

   #+BEGIN_SRC groovy :tangle ../main.nf
     process octfta {
       container 'robsyme/nf-repeatmasking'

       input:
       file 'reference.fa' from reference
       set 'rm.out', 'rm.masked' from repeatMaskerKnownsMaskedTrimmed

       output:
       file 'summary.tsv' into repeatmaskerSummaryTable

       """
     build_dictionary.pl --rm rm.out > ltr.dict
     one_code_to_find_them_all.pl --rm rm.out --ltr ltr.dict --fasta reference.fa
     echo -e 'Family\\tElement Length\\tFragments\\tCopies\\tSolo_LTR\\tTotal_Bp\\tCover\\tchrname' > summary.tsv
     for file in *.copynumber.csv; do
       chrname=`echo \$file | sed -e 's/^rm\\.out_//' -e 's/.copynumber.csv\$//'`
       awk -v chrname=\$chrname 'BEGIN{OFS="\\t"} NR>1 && /^[^#]/ {print(\$0, chrname)}' \$file
     done >> summary.tsv
       """
     }
   #+END_SRC

** Summary tables and figures

   #+BEGIN_SRC groovy :tangle ../main.nf
     process summarise {
       publishDir "${params.outdir}/summarise", mode: 'copy'

       input:
       file 'summary.tsv' from repeatmaskerSummaryTable

       output:
       set 'summary.bycontig.tidy.tsv', 'summary.tidy.tsv'

       """
     #!/usr/bin/env Rscript
     library(ggplot2)
     library(dplyr)
     library(tidyr)
     library(magrittr)

     data <- read.table('summary.tsv', header=TRUE) %>%
             separate(Family, into=c("Family", "Subfamily"), sep="/") %>%
             group_by(chrname, Family, Subfamily) %>%
             summarise(fragment.count = sum(Fragments), length = sum(Total_Bp)) %>%
             unite("Family", Family, Subfamily, sep="/")

     write.table(data, file='summary.bycontig.tidy.tsv')

     data <- read.table('summary.tsv', header=TRUE) %>%
             separate(Family, into=c("Family", "Subfamily"), sep="/") %>%
             group_by(Family, Subfamily) %>%
             summarise(fragment.count = sum(Fragments), length = sum(Total_Bp)) %>%
             unite("Family", Family, Subfamily, sep="/")

     write.table(data, file='summary.tidy.tsv', row.names = FALSE)
       """
     }
   #+END_SRC

   #+BEGIN_SRC groovy :tangle ../main.nf
     workflow.onComplete {
         log.info "Pipeline completed at: $workflow.complete"
         log.info "Execution status: ${ workflow.success ? 'OK' : 'failed' }"
     }
   #+END_SRC
