docs/overview.html

<div id="outline-container-orgeadaf53" class="outline-3">
<h3 id="orgeadaf53"><span class="section-number-3">2.7</span> Noncoding RNA</h3>
<div class="outline-text-3" id="text-2-7">
<p>
We'll borrow the excellent ncRNA prediction steps from the
excellent <a href="https://github.com/sanger-pathogens/companion">Companion annotation pipeline</a>.
</p>

<div class="org-src-container">
<pre class="src src-groovy">process predict_ncRNA {
  container <span style="color: #98be65;">'sangerpathogens/companion:latest'</span>

  input:
  file <span style="color: #98be65;">'genome.fasta'</span> from reference

  output:
  file <span style="color: #98be65;">'cm_out'</span> into cmtblouts

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">cp /opt/data/cm/rnas.cm models.cm</span>
<span style="color: #98be65;">cmpress -F models.cm</span>
<span style="color: #98be65;">cmsearch --cpu 1 --tblout cm_out --cut_ga models.cm genome.fasta</span>
<span style="color: #98be65;">  """</span>
}

process merge_ncrnas {
  container <span style="color: #98be65;">'sangerpathogens/companion:latest'</span>
  cache <span style="color: #98be65;">'deep'</span>

  input:
  file <span style="color: #98be65;">'cmtblout'</span> from cmtblouts

  output:
  file <span style="color: #98be65;">'ncrna.gff3'</span> into ncrnafile

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">  infernal_to_gff3.lua &lt; </span><span style="color: #dcaeea;">${cmtblout}</span><span style="color: #98be65;"> &gt; 1</span>
<span style="color: #98be65;">  gt gff3 -sort -tidy -retainids 1 &gt; ncrna.gff3</span>
<span style="color: #98be65;">  """</span>
}

ncrnafile.println()
</pre>
</div>
</div>
</div>

<div id="outline-container-org41d7682" class="outline-3">
<h3 id="org41d7682"><span class="section-number-3">2.8</span> Final Masking</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">
<pre class="src src-groovy">repeatmaskerKnowns
.mix(identifiedTransposons)
.collectFile() { <span style="color: #dcaeea;">it</span>.text }
.combine(allLTR2)
.set { knownRepeats }
</pre>
</div>

<div class="org-src-container">
<pre class="src src-groovy">process repeatMaskerKnowns {
  container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>
  publishDir <span style="color: #98be65;">"</span><span style="color: #dcaeea;">${params.outdir}</span><span style="color: #98be65;">/repeatMaskerKnowns"</span>, mode: <span style="color: #98be65;">'copy'</span>

  input:
  file <span style="color: #98be65;">'reference.fasta'</span> from reference
  set <span style="color: #98be65;">'knownTransposons.lib'</span>, <span style="color: #98be65;">'allLTRs.lib'</span> from knownRepeats

  output:
  set <span style="color: #98be65;">'reference.fasta.out'</span>, <span style="color: #98be65;">'reference.fasta.masked'</span> into repeatMaskerKnownsMasked
  set <span style="color: #98be65;">'reference.fasta.out.gff'</span>, <span style="color: #98be65;">'knownRepeats.library.fasta'</span>

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">cat *.lib &gt; knownRepeats.library.fasta</span>
<span style="color: #98be65;">RepeatMasker \</span>
<span style="color: #98be65;"> -lib knownRepeats.library.fasta \</span>
<span style="color: #98be65;"> -nolow \</span>
<span style="color: #98be65;"> -no_is \</span>
<span style="color: #98be65;"> -dir . \</span>
<span style="color: #98be65;"> -gff \</span>
<span style="color: #98be65;"> -s \</span>
<span style="color: #98be65;"> reference.fasta</span>
<span style="color: #98be65;">  """</span>
}

process removeShortMatches {
  container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>
  publishDir <span style="color: #98be65;">"</span><span style="color: #dcaeea;">${params.outdir}</span><span style="color: #98be65;">/cleanMasked"</span>, mode: <span style="color: #98be65;">'copy'</span>

  input:
  file <span style="color: #98be65;">'reference.fa'</span> from reference
  set <span style="color: #98be65;">'rm.out'</span>, <span style="color: #98be65;">'rm.masked'</span> from repeatMaskerKnownsMasked

  output:
  set <span style="color: #98be65;">'rm.trimmed.out'</span>, <span style="color: #98be65;">'rm.trimmed.masked'</span> into repeatMaskerKnownsMaskedTrimmed

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">head -n 3 rm.out &gt; rm.trimmed.out</span>
<span style="color: #98be65;">tail -n +4 rm.out | awk '\$7 - \$6 &gt; </span><span style="color: #dcaeea;">${params.minRepLength}</span><span style="color: #98be65;">' &gt;&gt; rm.trimmed.out</span>
<span style="color: #98be65;">tail -n +4 rm.out | awk 'BEGIN{OFS="\\t"} \$7 - \$6 &gt; </span><span style="color: #dcaeea;">${params.minRepLength}</span><span style="color: #98be65;"> {print \$5, \$6, \$7}' &gt;&gt; rm.trimmed.bed</span>
<span style="color: #98be65;">maskFastaFromBed -fi reference.fa -bed rm.trimmed.bed -fo rm.trimmed.masked -soft</span>
<span style="color: #98be65;">  """</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-groovy">process octfta {
  container <span style="color: #98be65;">'robsyme/nf-repeatmasking'</span>

  input:
  file <span style="color: #98be65;">'reference.fa'</span> from reference
  set <span style="color: #98be65;">'rm.out'</span>, <span style="color: #98be65;">'rm.masked'</span> from repeatMaskerKnownsMaskedTrimmed

  output:
  file <span style="color: #98be65;">'summary.tsv'</span> into repeatmaskerSummaryTable

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">build_dictionary.pl --rm rm.out &gt; ltr.dict</span>
<span style="color: #98be65;">one_code_to_find_them_all.pl --rm rm.out --ltr ltr.dict --fasta reference.fa</span>
<span style="color: #98be65;">echo -e 'Family\\tElement Length\\tFragments\\tCopies\\tSolo_LTR\\tTotal_Bp\\tCover\\tchrname' &gt; summary.tsv</span>
<span style="color: #98be65;">for file in *.copynumber.csv; do</span>
<span style="color: #98be65;">  chrname=`echo \$file | sed -e 's/^rm\\.out_//' -e 's/.copynumber.csv\$//'`</span>
<span style="color: #98be65;">  awk -v chrname=\$chrname 'BEGIN{OFS="\\t"} NR&gt;1 &amp;&amp; /^[^#]/ {print(\$0, chrname)}' \$file</span>
<span style="color: #98be65;">done &gt;&gt; summary.tsv</span>
<span style="color: #98be65;">  """</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org478605c" class="outline-3">
<h3 id="org478605c"><span class="section-number-3">2.9</span> Summary tables and figures</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">
<pre class="src src-groovy">process summarise {
  publishDir <span style="color: #98be65;">"</span><span style="color: #dcaeea;">${params.outdir}</span><span style="color: #98be65;">/summarise"</span>, mode: <span style="color: #98be65;">'copy'</span>

  input:
  file <span style="color: #98be65;">'summary.tsv'</span> from repeatmaskerSummaryTable

  output:
  set <span style="color: #98be65;">'summary.bycontig.tidy.tsv'</span>, <span style="color: #98be65;">'summary.tidy.tsv'</span>

  <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">#!/usr/bin/env Rscript</span>
<span style="color: #98be65;">library(ggplot2)</span>
<span style="color: #98be65;">library(dplyr)</span>
<span style="color: #98be65;">library(tidyr)</span>
<span style="color: #98be65;">library(magrittr)</span>

<span style="color: #98be65;">data &lt;- read.table('summary.tsv', header=TRUE) %&gt;%</span>
<span style="color: #98be65;">        separate(Family, into=c("Family", "Subfamily"), sep="/") %&gt;%</span>
<span style="color: #98be65;">        group_by(chrname, Family, Subfamily) %&gt;%</span>
<span style="color: #98be65;">        summarise(fragment.count = sum(Fragments), length = sum(Total_Bp)) %&gt;%</span>
<span style="color: #98be65;">        unite("Family", Family, Subfamily, sep="/")</span>

<span style="color: #98be65;">write.table(data, file='summary.bycontig.tidy.tsv')</span>

<span style="color: #98be65;">data &lt;- read.table('summary.tsv', header=TRUE) %&gt;%</span>
<span style="color: #98be65;">        separate(Family, into=c("Family", "Subfamily"), sep="/") %&gt;%</span>
<span style="color: #98be65;">        group_by(Family, Subfamily) %&gt;%</span>
<span style="color: #98be65;">        summarise(fragment.count = sum(Fragments), length = sum(Total_Bp)) %&gt;%</span>
<span style="color: #98be65;">        unite("Family", Family, Subfamily, sep="/")</span>

<span style="color: #98be65;">write.table(data, file='summary.tidy.tsv', row.names = FALSE)</span>
<span style="color: #98be65;">  """</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-groovy">workflow.onComplete {
    log.info <span style="color: #98be65;">"Pipeline completed at: </span><span style="color: #dcaeea;">$workflow.complete</span><span style="color: #98be65;">"</span>
    log.info <span style="color: #98be65;">"Execution status: </span><span style="color: #dcaeea;">${ workflow.success ? 'OK' : 'failed' }</span><span style="color: #98be65;">"</span>
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Robert Syme</p>
<p class="date">Created: 2018-01-03 Wed 16:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
